'''
Создать телефонный справочник с
возможностью импорта и экспорта данных в
формате .txt. Фамилия, имя, отчество, номер
телефона - данные, которые должны находиться
в файле.
1. Программа должна выводить данные
2. Программа должна сохранять данные в
текстовом файле
3. Пользователь может ввести одну из
характеристик для поиска определенной
записи(Например имя или фамилию
человека)
4. Использование функций. Ваша программа
не должна быть линейной

Задача 38: Дополнить телефонный справочник возможностью изменения и удаления данных.
Пользователь также может ввести имя или фамилию, и Вы должны реализовать функционал
для изменения и удаления данных.



'''


def what_to_do():
    '''Запрашиваем что пользователь хочет сделать:
        просмотреть таблицу,
        поискать определённый контакт
        или ввести контакт.'''
    return 0


def create_db_or_load_db():
    return 0


def input_contact():
    return 0


def edit_contact():
    return 0


def search_contact():
    return 0


def print_contact():
    return 0


def print_whole_db():
    return 0


def save_db_file():
    return 0


def load_db_file():
    return 0


def main():
    ''' 
    
    '''
    return 0
